-- phpMyAdmin SQL Dump
-- version 5.2.1
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1
-- Generation Time: May 16, 2025 at 03:37 PM
-- Server version: 10.4.32-MariaDB
-- PHP Version: 8.2.12

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `tmfood`
--

--
-- Dumping data for table `categorys`
--

INSERT INTO `categorys` (`id`, `name`, `createdAt`, `updatedAt`) VALUES
(1, 'Mì kim chi', '2025-05-12 09:06:46', '2025-05-12 09:06:46'),
(2, 'Mì lẩu thái', '2025-05-12 09:06:46', '2025-05-12 09:06:46'),
(3, 'Nước uống', '2025-05-12 09:07:14', '2025-05-12 09:07:14');

--
-- Dumping data for table `foodorders`
--

INSERT INTO `foodorders` (`id`, `tableOrderId`, `foodId`, `quantity`, `totalPrice`, `createdAt`, `updatedAt`) VALUES
(33, 19, 5, 1, '50000', '2025-05-16 09:06:23', '2025-05-16 09:06:23'),
(34, 20, 4, 1, '60000', '2025-05-16 09:29:10', '2025-05-16 09:29:10'),
(35, 21, 6, 1, '69000', '2025-05-16 10:47:10', '2025-05-16 10:47:10'),
(36, 22, 4, 1, '60000', '2025-05-16 11:28:03', '2025-05-16 11:28:03'),
(37, 22, 5, 1, '50000', '2025-05-16 11:28:03', '2025-05-16 11:28:03'),
(38, 23, 9, 3, '195000', '2025-05-16 12:23:11', '2025-05-16 12:23:11'),
(39, 23, 10, 1, '65000', '2025-05-16 12:23:11', '2025-05-16 12:23:11'),
(40, 24, 5, 1, '50000', '2025-05-16 12:28:16', '2025-05-16 12:28:16'),
(41, 25, 4, 1, '60000', '2025-05-16 12:43:52', '2025-05-16 12:43:52'),
(42, 25, 5, 2, '100000', '2025-05-16 12:43:52', '2025-05-16 12:43:52');

--
-- Dumping data for table `foods`
--

INSERT INTO `foods` (`id`, `name`, `categoryId`, `price`, `image`, `createdAt`, `updatedAt`) VALUES
(4, 'MÌ KIM CHI VIÊN HẢI SẢN', 1, 60000, 'http://localhost:8080/uploads/mÃ¬.jpg', '0000-00-00 00:00:00', '2025-05-16 11:13:17'),
(5, 'MÌ KIM CHI CÁ', 1, 50000, 'mì.jpg', '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(6, 'MÌ KIM CHI BẠCH TUỘC', 1, 69000, 'mì.jpg', '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(7, 'MÌ KIM CHI SỤN', 1, 69000, 'mì.jpg', '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(8, 'MÌ KIM CHI BÒ CUỘN NẤM, TRỨNG', 1, 69000, 'mì.jpg', '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(9, 'MÌ LẨU THÁI BÒ', 2, 65000, 'mì.jpg', '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(10, 'MÌ LẨU THÁI GÀ', 2, 65000, 'mì.jpg', '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(11, 'MÌ LẨU THÁI THẬP CẨM', 2, 70000, 'mì.jpg', '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(12, 'MÌ LẨU THÁI VIÊN HẢI SẢN', 2, 60000, 'mì.jpg', '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(13, 'MÌ LẨU THÁI CÁ', 2, 59000, 'mì.jpg', '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(14, 'MÌ LẨU THÁI BẠCH TUỘC', 2, 69000, 'mì.jpg', '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(15, 'MÌ LẨU THÁI SỤN', 2, 69000, 'mì.jpg', '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(16, 'MÌ LẨU THÁI BÒ CUỘN NẤM, TRỨNG', 2, 69000, 'mì.jpg', '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(17, 'MÌ LẨU THÁI HẢI SẢN', 2, 69000, 'mì.jpg', '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(29, 'Trà đào cam sả', 3, 56000, 'http://localhost:8080/uploads/nÆ°á»c.jpg', '2025-05-12 09:05:24', '2025-05-16 11:13:49'),
(30, 'Nước cam ép', 3, 50000, 'http://localhost:8080/uploads/nÆ°á»c.jpg', '2025-05-12 09:15:31', '2025-05-16 11:14:15'),
(32, 'Trà Ô Long', 3, 50000, 'http://localhost:8080/uploads/nÆ°á»c.jpg', '2025-05-15 15:38:39', '2025-05-16 11:14:24'),
(36, 'MÌ KIM CHI BÒ', 1, 60000, 'http://localhost:8080/uploads/mÃ¬.jpg', '2025-05-15 15:50:08', '2025-05-15 15:50:08'),
(44, 'MÌ KIM CHI VIÊN HẢI SẢN', 1, 45000, 'http://localhost:8080/uploads/mÃ¬.jpg', '2025-05-15 15:58:39', '2025-05-15 15:58:39'),
(63, 'Nước lọc', 3, 5000, 'http://localhost:8080/uploads/nÆ°á»c.jpg', '2025-05-16 10:42:44', '2025-05-16 10:42:44');

--
-- Dumping data for table `tableorders`
--

INSERT INTO `tableorders` (`id`, `tableId`, `customerName`, `customerPhone`, `status`, `createdAt`, `updatedAt`) VALUES
(19, 1, 'Lam Tran', '091234233', '', '2025-05-16 09:06:23', '2025-05-16 09:18:23'),
(20, 2, 'Lam Tran', '33242323', '', '2025-05-16 09:29:10', '2025-05-16 09:35:17'),
(21, 2, 'Lam Tran', '092342333', '', '2025-05-16 10:47:10', '2025-05-16 11:15:16'),
(22, 4, 'Lam Tran', '33242323', '', '2025-05-16 11:28:03', '2025-05-16 11:29:57'),
(23, 2, 'Lam Tran', '33242323', '', '2025-05-16 12:23:11', '2025-05-16 12:35:18'),
(24, 3, 'Lam Tran', '09234233', '', '2025-05-16 12:28:16', '2025-05-16 12:33:03'),
(25, 6, NULL, NULL, 'pending', '2025-05-16 12:43:52', '2025-05-16 12:43:52');

--
-- Dumping data for table `tables`
--

INSERT INTO `tables` (`id`, `name`, `status`, `createdAt`, `updatedAt`) VALUES
(1, 'Bàn 1', 'empty', '2025-05-13 03:05:34', '2025-05-16 11:53:12'),
(2, 'Bàn 2', 'empty', '2025-05-13 03:05:42', '2025-05-16 12:35:18'),
(3, 'Bàn 3', 'empty', '2025-05-13 03:05:45', '2025-05-16 12:33:03'),
(4, 'Bàn 4', 'empty', '2025-05-13 03:05:48', '2025-05-16 11:53:12'),
(5, 'Bàn 5', 'empty', '2025-05-13 03:05:52', '2025-05-16 11:53:12'),
(6, 'Bàn 6', 'waiting', '2025-05-13 03:05:55', '2025-05-16 12:43:52'),
(7, 'Bàn 7', 'selected', '2025-05-13 03:05:58', '2025-05-16 12:40:36'),
(8, 'Bàn 8', 'empty', '2025-05-13 03:06:02', '2025-05-16 11:53:12'),
(9, 'Bàn 9', 'empty', '2025-05-13 03:06:05', '2025-05-16 11:53:12'),
(10, 'Bàn 10', 'empty', '2025-05-13 03:06:09', '2025-05-16 11:53:12'),
(11, 'Bàn 11', 'empty', '2025-05-13 03:06:12', '2025-05-16 11:53:12'),
(12, 'Bàn 12', 'empty', '2025-05-13 03:06:15', '2025-05-16 11:53:12');

--
-- Dumping data for table `users`
--

INSERT INTO `users` (`id`, `username`, `password`, `name`, `phone`, `createdAt`, `updatedAt`) VALUES
(1, 'staff1', '123456', 'Trần Văn A', '082342322', '2025-05-12 09:05:59', '2025-05-12 09:05:59'),
(2, 'admin', '123456', 'Admin TMFood', '092342333', '2025-05-16 12:17:19', '2025-05-16 12:17:19');
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
